-- phpMyAdmin SQL Dump
-- version 5.1.1
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Июн 14 2022 г., 14:42
-- Версия сервера: 8.0.24
-- Версия PHP: 7.4.27

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `firstbit`
--

-- --------------------------------------------------------

--
-- Структура таблицы `chapter`
--

CREATE TABLE `chapter` (
  `id` int NOT NULL,
  `title` varchar(256) COLLATE utf8mb4_general_ci NOT NULL,
  `description` text COLLATE utf8mb4_general_ci,
  `parent_id` int NOT NULL,
  `updated_at` timestamp NOT NULL,
  `created_at` timestamp NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `chapter`
--

INSERT INTO `chapter` (`id`, `title`, `description`, `parent_id`, `updated_at`, `created_at`) VALUES
(1, 'Меркурий', 'Спутников у Меркурия, по современным данным, нет, хотя такие предположения выдвигались ранее.', -1, '2022-06-11 11:00:16', '2022-06-11 11:00:16'),
(5, 'Венера', 'В прошлом имели место многочисленные заявления о наблюдении спутников Венеры. Но по современным данным, естественных спутников у Венеры нет, а астероид 2002 VE68 является лишь квазиспутником.', -1, '2022-06-12 17:00:00', '2022-06-12 17:00:00'),
(6, 'Земля', 'У Земли всего один «полноценный» спутник — Луна, но целых 6 квазиспутников: (3753) Круитни, 2003 YN107 и (164207) 2004 GU9,[2] (419624) 2010 SO16,[3] а также (367943) Дуэнде и (469219) 2016 HO3. Есть теории о гипотетических спутниках Земли и Луны и о подобии колец.', -1, '2022-06-14 10:42:04', '2022-06-14 10:42:04'),
(7, 'Марс', 'У Марса известно всего два спутника: Деймос (1877) и Фобос (1877)', -1, '2022-06-14 10:42:26', '2022-06-14 10:42:26'),
(8, 'Юпитер', 'У Юпитера известно 80 спутников, в том числе открытые до полёта «Вояджеров»', -1, '2022-06-14 10:42:55', '2022-06-14 10:42:55'),
(9, 'Сатурн', 'У Сатурна известно 83 спутника, в том числе открытые до полёта «Вояджеров»', -1, '2022-06-14 10:42:41', '2022-06-14 10:42:41'),
(10, 'Уран', 'У Урана известно 27 спутников', -1, '2022-06-14 10:42:48', '2022-06-14 10:42:48'),
(11, 'Луна', 'Луна́ — единственный естественный спутник Земли. Самый близкий к Солнцу спутник планеты, так как у ближайших к Солнцу планет (Меркурия и Венеры) их нет. Второй по яркости[комм. 1] объект на земном небосводе после Солнца и пятый по величине естественный спутник планеты Солнечной системы. Среднее расстояние между центрами Земли и Луны — 384 467 км (0,00257 а.е., ~30 диаметров Земли).', 6, '2022-06-14 10:42:12', '2022-06-14 10:42:12'),
(12, 'Нептун', 'У Нептуна известно 14 спутников', -1, '2022-06-14 10:42:33', '2022-06-14 10:42:33'),
(50, 'НЛО возле Земли', '123', 6, '2022-06-14 04:15:28', '2022-06-14 04:15:28'),
(51, 'Каллисто', '123', 8, '2022-06-14 04:17:10', '2022-06-14 04:17:10'),
(53, 'Европа', '', 8, '2022-06-14 04:27:28', '2022-06-14 04:27:28'),
(60, 'Ио', '', 8, '2022-06-14 05:40:46', '2022-06-14 05:40:46'),
(64, 'Первый полет человека на Марс', '', 7, '2022-06-14 07:29:12', '2022-06-14 07:29:12');

-- --------------------------------------------------------

--
-- Структура таблицы `elem`
--

CREATE TABLE `elem` (
  `id` int NOT NULL,
  `parent_id` int NOT NULL,
  `title` varchar(256) COLLATE utf8mb4_general_ci NOT NULL,
  `updated_at` timestamp NOT NULL,
  `created_at` timestamp NOT NULL,
  `type` text COLLATE utf8mb4_general_ci,
  `link` text COLLATE utf8mb4_general_ci
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `elem`
--

INSERT INTO `elem` (`id`, `parent_id`, `title`, `updated_at`, `created_at`, `type`, `link`) VALUES
(3, 11, 'Первый полет на Луну', '2022-06-14 10:53:19', '2022-06-14 10:53:19', '0', NULL),
(5, -1, ' ', '2022-06-14 10:53:09', '2022-06-14 10:53:09', '0', NULL),
(8, 9, 'Титан', '2022-06-14 07:26:48', '2022-06-14 07:26:48', NULL, NULL),
(9, 9, 'Энцелад', '2022-06-14 07:27:08', '2022-06-14 07:27:08', NULL, NULL),
(11, 64, 'Илон Маск в шоке, русские опять первее', '2022-06-14 07:38:56', '2022-06-14 07:38:56', NULL, NULL);

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `chapter`
--
ALTER TABLE `chapter`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `elem`
--
ALTER TABLE `elem`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `chapter`
--
ALTER TABLE `chapter`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=65;

--
-- AUTO_INCREMENT для таблицы `elem`
--
ALTER TABLE `elem`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
